#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
aws_api_gateway_deployment.this (deposed object 2cbf95a8): Refreshing state... [id=y54gow]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
data.aws_availability_zones.available: Reading...
aws_api_gateway_deployment.this (deposed object b766a9f9): Refreshing state... [id=ilnrcr]
aws_api_gateway_deployment.this (deposed object 1c25ffb8): Refreshing state... [id=8q8423]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
aws_api_gateway_deployment.this (deposed object adeca273): Refreshing state... [id=6nc7dh]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
aws_api_gateway_deployment.this (deposed object 8966f15d): Refreshing state... [id=5kqc15]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
data.aws_ami.latest_amazon_linux: Reading...
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.inference.data.aws_ecr_image.lambda_image: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.inference.module.api_gateway.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Reading...
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
aws_api_gateway_api_key.this: Refreshing state... [id=mwfvag0h0f]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:fae6902f5ed2c8e16955a2aff5031a4f58f5c31d26a60fde5f7f4ec38074360e]
data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-03c951bbe993ea087]
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:59948e6ed9ce17e8549df33c33aabb6dbff86ed0a937a0b512a8a7e5d056469c]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.inference.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:b140b999b110f84e802cdc01a498f4fab768508093c32becdc4d13efd1267d8b]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:7cdda1d11d47842278f8f677a64b06f49e5a247876ec401e01740f6b69154815]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
data.aws_secretsmanager_secret.password: Reading...
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:428a55ffe8051416ac12b825bd40486dd071c38ac907151e286c088d01f00b6d]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
data.aws_secretsmanager_secret_version.password: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
module.inference.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=c30cce]
module.list_collections.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=i033qb]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.inference.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-c30cce-GET]
module.list_collections.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-i033qb-GET]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-c30cce-OPTIONS]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-i033qb-OPTIONS]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-c30cce-OPTIONS]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-c30cce-OPTIONS-200]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.inference.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.list_collections.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-i033qb-OPTIONS-200]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-i033qb-OPTIONS]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-c30cce-OPTIONS-200]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-i033qb-OPTIONS-200]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
aws_instance.jumpbox: Refreshing state... [id=i-0cd5eadbd064719b1]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
module.inference.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-c30cce-GET]
module.list_collections.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-i033qb-GET]
aws_api_gateway_deployment.this: Refreshing state... [id=0blpxs]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-02-12T17:15:39Z" -> (known after apply)
      ~ description   = "Deployment for 2024-02-12T17:15:39Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "0blpxs" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-02-12T17:15:39Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_deployment.this (deposed object 1c25ffb8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "this" {
      - created_date  = "2024-02-12T16:37:32Z" -> null
      - description   = "Deployment for 2024-02-12T16:37:32Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> null
      - id            = "8q8423" -> null
      - invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "d09uj3e9kh" -> null
      - triggers      = {
          - "redeployment" = "2024-02-12T16:37:32Z"
        } -> null
    }

  # aws_api_gateway_deployment.this (deposed object 2cbf95a8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "this" {
      - created_date  = "2024-02-12T17:09:14Z" -> null
      - description   = "Deployment for 2024-02-12T17:09:13Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> null
      - id            = "y54gow" -> null
      - invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "d09uj3e9kh" -> null
      - triggers      = {
          - "redeployment" = "2024-02-12T17:09:13Z"
        } -> null
    }

  # aws_api_gateway_deployment.this (deposed object 8966f15d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "this" {
      - created_date  = "2024-02-12T16:21:31Z" -> null
      - description   = "Deployment for 2024-02-12T16:21:31Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> null
      - id            = "5kqc15" -> null
      - invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "d09uj3e9kh" -> null
      - triggers      = {
          - "redeployment" = "2024-02-12T16:21:31Z"
        } -> null
    }

  # aws_api_gateway_deployment.this (deposed object adeca273) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "this" {
      - created_date  = "2024-02-12T14:54:58Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> null
      - id            = "6nc7dh" -> null
      - invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "d09uj3e9kh" -> null
    }

  # aws_api_gateway_deployment.this (deposed object b766a9f9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_api_gateway_deployment" "this" {
      - created_date  = "2024-02-12T16:56:03Z" -> null
      - description   = "Deployment for 2024-02-12T16:56:02Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> null
      - id            = "ilnrcr" -> null
      - invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "d09uj3e9kh" -> null
      - triggers      = {
          - "redeployment" = "2024-02-12T16:56:02Z"
        } -> null
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "0blpxs" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_api_gateway_usage_plan_key.this will be created
  + resource "aws_api_gateway_usage_plan_key" "this" {
      + id            = (known after apply)
      + key_id        = "mwfvag0h0f"
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = "jxe0z0"
      + value         = (known after apply)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:1ea4bed4a6f3fa24299f8a5fa9353dafe13f12d790c36afc910617365eece669" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:b140b999b110f84e802cdc01a498f4fab768508093c32becdc4d13efd1267d8b"
      ~ last_modified                  = "2024-02-12T17:08:44.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:46c39fc64c86b63ca73774f867b64f230b9591a8c154cc89c87870fff8145d43" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:7cdda1d11d47842278f8f677a64b06f49e5a247876ec401e01740f6b69154815"
      ~ last_modified                  = "2024-02-12T17:08:44.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:5301c93ec32cb799738af8685fd4f267c7cf7cf35a3673ddda1ba16961934d48" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:fae6902f5ed2c8e16955a2aff5031a4f58f5c31d26a60fde5f7f4ec38074360e"
      ~ last_modified                  = "2024-02-12T17:08:44.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:ff8d1d137ad73abcec46e6c5beed8e89f9a3c29373c6aa33ae352d8b20658647" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:59948e6ed9ce17e8549df33c33aabb6dbff86ed0a937a0b512a8a7e5d056469c"
      ~ last_modified                  = "2024-02-12T17:08:44.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:76d4d6b01c1f3a45d799053056fc68d5e2852b8072fc55b81c1f377e68f4859e" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:428a55ffe8051416ac12b825bd40486dd071c38ac907151e286c088d01f00b6d"
      ~ last_modified                  = "2024-02-12T17:08:44.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*